Revit 2027 API
StairsPathDirection Enumeration
 The direction style of stairs path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum StairsPathDirection
Public Enumeration StairsPathDirection
public enum class StairsPathDirection
type StairsPathDirection
Members
Member name | Value | Description
AlwaysUp | 0 |  The direction of the stair path will always be UP direction.
AutomaticUpDown | 1 |  The direction of the stair path will be determined automatically.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace